---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.FormulasFailedForType
source: html/de276ae4-0734-70f5-6027-801d464c594b.htm
---
# Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.FormulasFailedForType Property

"Can't satisfy formulas for type [Family Symbol].

## Syntax (C#)
```csharp
public static FailureDefinitionId FormulasFailedForType { get; }
```